КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТранспортныхСредств/КонтурЛогистика_ТипыТранспортныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыТранспортныхСредств</name>
  <enumValues>
    <name>Легковой</name>
  </enumValues>
  <enumValues>
    <name>Автобус</name>
  </enumValues>
  <enumValues>
    <name>Грузовой</name>
  </enumValues>
  <enumValues>
    <name>ТрамвайТроллейбус</name>
  </enumValues>
  <enumValues>
    <name>Иной</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТранспортныхСредств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеДляXDTO(Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Легковой Тогда
		
		Результат = "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Автобус Тогда
		
		Результат = "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.ТрамвайТроллейбус Тогда
		
		Результат = "3";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Грузовой Тогда
		
		Результат = "4";
		
	Иначе
		
		Результат = "5";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Значение) Экспорт
	
	Если Значение = "1" Тогда 
		
		Результат = Легковой;
		
	ИначеЕсли Значение = "2" Тогда 
		
		Результат = Автобус;
		
	ИначеЕсли Значение = "3" Тогда 
		
		Результат = ТрамвайТроллейбус;
		
	ИначеЕсли Значение = "4" Тогда 
		
		Результат = Грузовой;
		
	ИначеЕсли Значение = "5" Тогда 
		
		Результат = Иной;
		
	Иначе		
		
		Результат = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
